Documents/ЛБ_Реализация.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ЛБ_Реализация</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ЛБ_РеализованныеОбъектыЗалога</xr:Item>
				<xr:Item>AccumulationRegister.ЛБ_ОбъектыЗалога</xr:Item>
				<xr:Item>AccumulationRegister.ЛБ_ДенежныеСредства</xr:Item>
				<xr:Item>AccumulationRegister.ЛБ_РасчетыСКлиентами</xr:Item>
				<xr:Item>AccumulationRegister.ЛБ_НачислениеПроцентовДетально</xr:Item>
				<xr:Item>AccumulationRegister.ЛБ_ПрибылиИУбыткиОтРеализации</xr:Item>
				<xr:Item>InformationRegister.ЛБ_ОперацииДвиженияОбъектовЗалогаПоСкладам</xr:Item>
				<xr:Item>AccumulationRegister.ЛБ_ОборотыПоОперациямЗайма</xr:Item>
				<xr:Item>InformationRegister.ЛБ_СостояниеЗалоговогоБилета</xr:Item>
				<xr:Item>InformationRegister.ЛБ_СостояниеОбъектаЗалога</xr:Item>
				<xr:Item>AccumulationRegister.ЛБ_РасчетыСКлиентамиПоОбъектамЗалога</xr:Item>
				<xr:Item>AccumulationRegister.ЛБ_РасчетыСКлиентамиБУ</xr:Item>
				<xr:Item>AccumulationRegister.ЛБ_ДвиженияДенежныхСредств</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Комментарий</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтветственныйПользователь</Name>
					<Comment>Ответственный</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ломбард</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Ломбарды</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерРеализации</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредставлениеНомера</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Залогодатели</v8:Type>
						<v8:Type>cfg:CatalogRef._ДемоКонтрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЛБ_ВидыОперацийРеализация</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособОплаты</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЛБ_СпособыОплаты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Основание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаПродажи</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>id_LX</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтветственныйСотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ЗалоговыйБилет</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ЛБ_ОперацияПоЗалогу</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОбъектЗалога</Name>
							<Comment>Объект залога</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.ЛБ_ОбъектыЗалога</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Comment>Количество</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>2</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОтклонениеСкидки</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ЛБ_ОтклонениеОтБазовойЦены</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Скидка</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>6</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ФактическаяЦена</Name>
							<Comment>Цена реализации</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаОценки</Name>
							<Comment>Сумма оценки</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/ЛБ_ОбъектыЗалогаДобавленныеВРеализацию.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ЛБ_ОбъектыЗалогаДобавленныеВРеализацию</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДокументРеализации</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЛБ_Реализация</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Comment>Ответственный</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ЗалоговыйБилет</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЛБ_ОперацияПоЗалогу</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОбъектЗалога</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_ОбъектыЗалога</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ЛБ_РеквизитыОбъектаЗалога.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ЛБ_РеквизитыОбъектаЗалога</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Артикул</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВидИзделия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_ВидыИзделий</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Проба</Name>
					<Comment>Проба</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Пробы</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Категория</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_КатегорииОбъектовЗалога</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Клеймо</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЛБ_ВидыКлейм</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Именник</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЛБ_Именник</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДанныеИменника</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СостояниеИзделия</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЛБ_СостояниеИзделия</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Дефекты</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЕдиницаИзмерения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторЕдиницИзмерения</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Вес</Name>
					<Comment>Вес изделия</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВесЧистый</Name>
					<Comment>Чистый вес</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВесВПробеЧистоты</Name>
					<Comment>Вес в пробе чистоты</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Цена</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаОценки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОписаниеИзделия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаОценкиМакс</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаОценкиМеталлы</Name>
					<Comment>Сумма оценки металлов</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаОценкиКамни</Name>
					<Comment>Сумма оценки драг. камней</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НомерСтрокиТаблицы</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаСсуды</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Вставки</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Вес30</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОписаниеОЗ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1000</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ОбъектЗалога</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_ОбъектыЗалога</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЗалоговыйБилет</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЛБ_ОперацияПоЗалогу</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ЛБ_ГруппыОбъектовЗалога.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ЛБ_ГруппыОбъектовЗалога</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Группа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_ГруппыОбъектовЗалога</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ЗалоговыйБилет</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЛБ_ОперацияПоЗалогу</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОбъектЗалога</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_ОбъектыЗалога</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ЛБ_СпособыОплаты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ЛБ_СпособыОплаты</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>НаличныйРасчет</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РасчетныйСчет</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>БезналичныйРасчет</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/ЛБ_Реализация/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ТекПользователь = ПараметрыСеанса.ТекущийПользователь;   
	Если УправлениеДоступом.ЕстьРоль("ЛБ_Суперпользователь") Тогда 
		ЭтоСуперпользователь = Истина;
	КонецЕсли;	

	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда		
		Объект.Организация = Константы.ЛБ_ОсновнаяОрганизация.Получить(); 
		Объект.Дата = ТекущаяДатаСеанса(); 
		Объект.ОтветственныйПользователь = ТекПользователь;	
		Объект.ОтветственныйСотрудник    = ПараметрыСеанса.ТекущийСотрудник;
			
		Если ЭтоСуперпользователь Тогда   
			Объект.Ломбард = Справочники.ЛБ_Ломбарды.ЦентральныйОфис;  
			Объект.Склад = ЛБ_ОбщийМодуль.ПолучитьСклад(Объект.Ломбард, Перечисления.ЛБ_ВидыСкладов.ВитринаЦО);
			Объект.СпособОплаты = Перечисления.ЛБ_СпособыОплаты.НаличныйРасчет;
			Объект.ВидОперации = Перечисления.ЛБ_ВидыОперацийРеализация.РеализацияЦОРозница; 
		ИначеЕсли ТекПользователь.ЭтоЛомбард Тогда  
			Объект.Ломбард = ПараметрыСеанса.ТекущийЛомбард;
			Объект.Склад = ЛБ_ОбщийМодуль.ПолучитьСклад(Объект.Ломбард, Перечисления.ЛБ_ВидыСкладов.Витрина);
			Объект.СпособОплаты = Перечисления.ЛБ_СпособыОплаты.НаличныйРасчет;
			Объект.ВидОперации = Перечисления.ЛБ_ВидыОперацийРеализация.РеализацияЛомбард;
			Объект.Контрагент = ПредопределенноеЗначение("Справочник._ДемоКонтрагенты.РозничныйПокупатель");
		ИначеЕсли УправлениеДоступом.ЕстьРоль("ЛБ_СотрудникЦО") Тогда
			Объект.Ломбард = Справочники.ЛБ_Ломбарды.ЦентральныйОфис;  
			Объект.Склад = ЛБ_ОбщийМодуль.ПолучитьСклад(Объект.Ломбард, Перечисления.ЛБ_ВидыСкладов.ВитринаЦО);
			Объект.СпособОплаты = Перечисления.ЛБ_СпособыОплаты.НаличныйРасчет;
			Объект.ВидОперации = Перечисления.ЛБ_ВидыОперацийРеализация.РеализацияЦОРозница; 
			Объект.Контрагент = ПредопределенноеЗначение("Справочник._ДемоКонтрагенты.РозничныйПокупатель");
		Иначе
			ОбщегоНазначения.СообщитьПользователю("Документ «Реализация невостребованных залогов» доступен только сотрудникам ЦО и сотрудникам ломбарда.");
			Отказ = Истина;  
		КонецЕсли;
		ЭтаФорма.Заголовок = "Реализация невостребованных залогов (создание)"; 
	Иначе
		ЭтаФорма.Заголовок = "Реализация невостребованных залогов № " + СокрЛП(Объект.ПредставлениеНомера) + " от " + Формат(Объект.Дата, "ДЛФ=DT"); 
	КонецЕсли;     
	Если ТекПользователь.ЭтоЛомбард Тогда		
		ЭтоЛомбард = Истина;
	КонецЕсли;	
	УстановитьСостояниеДокумента(); 
	УстановитьВидимость(); 
	УстановитьВыборОперации();
	ЗаполнитьТаблицуТоваров();  
	УстановитьДоступностьКонтрагента();
	
	Если НЕ ЭтоСуперпользователь Тогда
		//+МАН 12.12.25 Изменил условие
		//Если НЕ НачалоДня(Объект.Дата) = НачалоДня(ТекущаяДатаСеанса()) Тогда  
		Если Объект.Проведен Тогда
			ЭтаФорма.ТолькоПросмотр = Истина;  
			Элементы.ТаблицаТоваров.ТолькоПросмотр = Истина;
			Элементы.ТаблицаТоваровДобавить.Доступность = Ложь; 
			Элементы.ТаблицаТоваровГруппаСкидки.Доступность = Ложь;
			//+МАН 26.11.25 Добавил
			Элементы.ТаблицаТоваровВыбратьДляРеализацииОпт.Доступность = Ложь;
			Элементы.ТаблицаТоваровДобавитьИзделие.Доступность = Ложь;
			//-МАН
		КонецЕсли;	
	КонецЕсли;
				
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	
	//ПоказатьСкрытьПечать();  
	
КонецПроцедуры

&НаСервере
Процедура ПоказатьСкрытьПечать()   
	
	Если Объект.ВидОперации = Перечисления.ЛБ_ВидыОперацийРеализация.РеализацияЦООпт тогда
		Элементы.ПодменюПечать.Видимость = Истина; 	
	иначе
		Элементы.ПодменюПечать.Видимость = Ложь;   
	КонецЕсли;	
КонецПроцедуры
 

&НаСервере
Процедура УстановитьВыборОперации()   
	Если ЭтоСуперпользователь Тогда 
		Элементы.ВидОперации.СписокВыбора.Добавить(Перечисления.ЛБ_ВидыОперацийРеализация.РеализацияЛомбард);
		Элементы.ВидОперации.СписокВыбора.Добавить(Перечисления.ЛБ_ВидыОперацийРеализация.РеализацияЦОРозница);
		Элементы.ВидОперации.СписокВыбора.Добавить(Перечисления.ЛБ_ВидыОперацийРеализация.РеализацияЦООпт);
	Иначе	
		Если ЭтоЛомбард Тогда 
			Элементы.ВидОперации.СписокВыбора.Добавить(Перечисления.ЛБ_ВидыОперацийРеализация.РеализацияЛомбард);
		Иначе 
			Элементы.ВидОперации.СписокВыбора.Добавить(Перечисления.ЛБ_ВидыОперацийРеализация.РеализацияЦОРозница);
			Элементы.ВидОперации.СписокВыбора.Добавить(Перечисления.ЛБ_ВидыОперацийРеализация.РеализацияЦООпт);
			//+МАН 09.12.25 У сотрудника ЦО не отображается вид операции когда открывается проведенный документ.
			Если Объект.Проведен Тогда
				Элементы.ВидОперации.СписокВыбора.Добавить(Перечисления.ЛБ_ВидыОперацийРеализация.РеализацияЛомбард);
			КонецЕсли;
			//-МАН
		КонецЕсли;	
	КонецЕсли;	
КонецПроцедуры

&НаСервере
Процедура УстановитьВидимость()  
	Если Объект.ВидОперации = Перечисления.ЛБ_ВидыОперацийРеализация.РеализацияЦООпт Тогда
		Элементы.Основание.Видимость = Истина;          
		Объект.СпособОплаты = Перечисления.ЛБ_СпособыОплаты.РасчетныйСчет;
		Элементы.ВыборСпособаОплаты.ТолькоПросмотр = Истина;  
		Элементы.ТаблицаТоваровВыбратьДляРеализацииОпт.Видимость = Истина;  
		Элементы.ТаблицаТоваровДобавитьИзделие.Видимость = Истина;
		Элементы.ТаблицаТоваровДобавить.Видимость = Ложь; 
		Элементы.ТаблицаТоваровГруппаСкидки.Доступность = Ложь;
	Иначе                                    
		Элементы.ВыборСпособаОплаты.ТолькоПросмотр = Ложь;
		Элементы.Основание.Видимость = Ложь;
		Элементы.ТаблицаТоваровВыбратьДляРеализацииОпт.Видимость = Ложь;  
		Элементы.ТаблицаТоваровДобавитьИзделие.Видимость = Ложь;
		Элементы.ТаблицаТоваровДобавить.Видимость = Истина;   
		Элементы.ТаблицаТоваровГруппаСкидки.Доступность = Истина; 	
	КонецЕсли;	
	Контрагет = неопределено;              
	Если ЭтоСуперпользователь И Объект.ВидОперации = Перечисления.ЛБ_ВидыОперацийРеализация.РеализацияЛомбард Тогда
	    Элементы.Ломбард.ТолькоПросмотр = Ложь; 
	КонецЕсли;	
КонецПроцедуры	 

&НаСервере
Процедура УстановитьДоступностьКонтрагента()  
	ПредельнаяСумма = ЛБ_УправлениеЛомбардом.ПолучитьПредельнуюСуммуДляИдентификацииКлиента(Объект.Дата, Объект.СпособОплаты); 
	Если ТаблицаТоваров.Итог("ФактическаяЦена") > ПредельнаяСумма Тогда
		Элементы.Контрагент.ТолькоПросмотр = Ложь;
	Иначе  
		Элементы.Контрагент.ТолькоПросмотр = Истина;
		Если ЗначениеЗаполнено(Объект.Контрагент) Тогда  
			Объект.Контрагент = неопределено;
		КонецЕсли;	
	КонецЕсли;	    
КонецПроцедуры	 

&НаСервере
Функция ПолучитьСклад(ВидСклада)
    Возврат ЛБ_ОбщийМодуль.ПолучитьСклад(Объект.Ломбард, ВидСклада);  
КонецФункции	
	
// СтандартныеПодсистемы.Печать 
&НаКлиенте 
Процедура Подключаемый_ВыполнитьКомандуПечати(Команда) 
	УправлениеПечатьюКлиент.ВыполнитьПодключаемуюКомандуПечати(Команда, ЭтаФорма, Объект); 
КонецПроцедуры 
// Конец СтандартныеПодсистемы.Печать 
// СтандартныеПодсистемы.ПодключаемыеКоманды 
&НаКлиенте 
Процедура Подключаемый_ВыполнитьКоманду(Команда) 
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект); 
КонецПроцедуры 
&НаСервере 
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат) 
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат); 
КонецПроцедуры 
&НаКлиенте 
Процедура Подключаемый_ОбновитьКоманды() 
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект); 
КонецПроцедуры 
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

&НаСервере
Процедура УстановитьСостояниеДокумента()
	
	СостояниеДокумента = ОбщегоНазначенияБП.СостояниеДокумента(Объект);
	
КонецПроцедуры          

&НаСервере
Процедура ЗаполнитьТаблицуДокумента()
	Объект.Товары.Загрузить(ТаблицаТоваров.Выгрузить());
КонецПроцедуры

&НаСервере
Функция ПолучитьНовыйНомерРеализации()   
	СтруктураВозврата = Новый Структура;  
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
	    НомерРеализации = ЛБ_УправлениеЛомбардом.ПолучитьНовыйНомерРеализации(Объект.Дата, Объект.Организация, Объект.Ломбард, Объект.Ссылка); 
	Иначе   
		НомерРеализации = ЛБ_УправлениеЛомбардом.ПолучитьНовыйНомерРеализации(Объект.Дата, Объект.Организация, Объект.Ломбард);
	КонецЕсли;	
	СтруктураВозврата.Вставить("НомерРеализации", НомерРеализации);	
	Если Объект.Ломбард = ПредопределенноеЗначение("Справочник.ЛБ_Ломбарды.ЦентральныйОфис") Тогда
		ПредставлениеНомера = СокрЛП(НомерРеализации);
	Иначе	
        ПредставлениеНомера = СокрЛП(Объект.Ломбард.НомерЛомбарда) + "/" +  СокрЛП(НомерРеализации);  
	КонецЕсли;	  
	СтруктураВозврата.Вставить("ПредставлениеНомера", ПредставлениеНомера);
    Возврат СтруктураВозврата;
КонецФункции	

&НаСервере
Функция ПроверкаОстатков() 
	ЕстьОшибки = Ложь;
	ТаблицаОстатков = ЛБ_УправлениеЛомбардом.ПолучитьТоварыНаСкладеЛомбарда(Объект.Дата, Объект.Организация, Объект.Ломбард, Объект.Склад);   
		
	Для каждого Стр Из ТаблицаТоваров Цикл  
		Отбор = новый структура;
		Отбор.Вставить("ЗалоговыйБилет", Стр.ЗалоговыйБилет); 
		Отбор.Вставить("ОбъектЗалога", Стр.ОбъектЗалога);
		СтрокиОст = ТаблицаОстатков.НайтиСтроки(Отбор);
		Если СтрокиОст.Количество() = 0 Тогда 
			Сообщить("Изделие с артикулом " + СокрЛП(Стр.Артикул) + " не найдено на складе " + СокрЛП(Объект.Склад));  
			ЕстьОшибки = Истина;  
		Иначе
			Стр.СуммаОценки = СтрокиОст.Получить(0).СуммаОценки;
		Конецесли;    
	Конеццикла;  
		
	Возврат ?(ЕстьОшибки, Ложь, Истина);
КонецФункции

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи) 
	ТекущийОбъект.СуммаПродажи = ТекущийОбъект.Товары.Итог("ФактическаяЦена");    
	Если НЕ ПараметрыЗаписи.РежимЗаписи = РежимЗаписиДокумента.Запись Тогда 
		Если НЕ НачалоДня(ТекущийОбъект.Дата) = НачалоДня(ТекущаяДатаСеанса()) Тогда
			Если НЕ ЭтоСуперпользователь Тогда 
				 Сообщить("Пользователь имеет право проводить документ только текущей датой. Измените дату документа.", статуссообщения.Важное);
			     Отказ = Истина;
				 Возврат;
			КонецЕсли;	
			Если ТекущийОбъект.СпособОплаты = Перечисления.ЛБ_СпособыОплаты.НаличныйРасчет Тогда
				Результат = ЛБ_ОбщийМодуль.ПолучитьОткрытуюКассовуюСмену(ТекущийОбъект.Дата, ТекущийОбъект.Организация, ТекущийОбъект.Ломбард); 
				Если Результат = неопределено Тогда  
					Сообщить("На дату документа не открыта кассовая смена в ломбарде!", статуссообщения.Важное);
			        Отказ = Истина; 
				КонецЕсли;
			КонецЕсли; 
		КонецЕсли;	
		ПредельнаяСумма = ЛБ_УправлениеЛомбардом.ПолучитьПредельнуюСуммуДляИдентификацииКлиента(ТекущийОбъект.Дата, ТекущийОбъект.СпособОплаты); 
		Если ТаблицаТоваров.Итог("ФактическаяЦена") > ПредельнаяСумма Тогда
			Если НЕ ЗначениеЗаполнено(ТекущийОбъект.Контрагент) тогда 
				Сообщить("Сумма продажи превышает предельное значение " + СокрЛП(Формат(ПредельнаяСумма, "ЧЦ=15; ЧДЦ=2")) + " руб., выбор контрагента обязателен.", статуссообщения.Важное);
		        Отказ = Истина; 
			КонецЕсли;	
		КонецЕсли;  
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)	
	Если ЗначениеЗаполнено(Объект.Ломбард) И (Объект.НомерРеализации = 0) Тогда
		Результат = ПолучитьНовыйНомерРеализации();
		Объект.НомерРеализации = Результат.НомерРеализации;
		Объект.ПредставлениеНомера = Результат.ПредставлениеНомера;
	КонецЕсли; 
	ЗаполнитьТаблицуДокумента();
	Если НЕ ПараметрыЗаписи.РежимЗаписи = РежимЗаписиДокумента.Запись Тогда
		Если ТаблицаТоваров.Количество() = 0 Тогда
			Сообщить("Не выбраны изделия для реализации.", статуссообщения.Важное);
			Отказ = Истина; 
		Иначе
			Для каждого Стр Из ТаблицаТоваров Цикл
				Если Стр.ФактическаяЦена = 0 Тогда 
					Сообщить("Для изделия " + СокрЛП(Стр.Артикул) + " не установлена фактическая цена.", статуссообщения.Важное);
			        Отказ = Истина; 
					Прервать;
				КонецЕсли;	
			КонецЦикла;	 
		КонецЕсли;      
		Если НЕ Отказ Тогда
			Если НЕ ПроверкаОстатков() Тогда  
				Отказ = Истина; 
			КонецЕсли; 
		КонецЕсли;
	КонецЕсли;		
КонецПроцедуры  

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи) 
	Для каждого Стр Из Объект.Товары Цикл
	    ЗаполнитьОбъектыЗалогаДобавленныеВРеализацию(Стр.ЗалоговыйБилет, Стр.ОбъектЗалога);
	КонецЦикла;	
	УстановитьСостояниеДокумента(); 
	ЭтаФорма.Заголовок = "Реализация невостребованных залогов № " + СокрЛП(Объект.ПредставлениеНомера) + " от " + Формат(Объект.Дата, "ДЛФ=DT");
КонецПроцедуры  

&НаСервере
Процедура ОчиститьУдаленныеЗалоги()
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДокументРеализации", Объект.Ссылка);
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_ОбъектыЗалогаДобавленныеВРеализацию.ЗалоговыйБилет КАК ЗалоговыйБилет,
	               |	ЛБ_ОбъектыЗалогаДобавленныеВРеализацию.ОбъектЗалога КАК ОбъектЗалога
	               |ИЗ
	               |	РегистрСведений.ЛБ_ОбъектыЗалогаДобавленныеВРеализацию КАК ЛБ_ОбъектыЗалогаДобавленныеВРеализацию
	               |ГДЕ
	               |	ЛБ_ОбъектыЗалогаДобавленныеВРеализацию.ДокументРеализации = &ДокументРеализации";   
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл  
		Отбор = Новый Структура;
		Отбор.Вставить("ЗалоговыйБилет", Выборка.ЗалоговыйБилет); 
		Отбор.Вставить("ОбъектЗалога", Выборка.ОбъектЗалога);  
		
		Строки  = Объект.Товары.НайтиСтроки(Отбор);
		Если Строки.Количество() = 0 Тогда
			УдалитьОбъектыЗалогаДобавленныеВРеализацию(Выборка.ЗалоговыйБилет, Выборка.ОбъектЗалога);
		КонецЕсли;	
	КонецЦикла;	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка) 
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) тогда
		Для каждого Стр Из Объект.Товары Цикл		
		    УдалитьОбъектыЗалогаДобавленныеВРеализацию(Стр.ЗалоговыйБилет, Стр.ОбъектЗалога);
		КонецЦикла;	 
	Иначе
		ОчиститьУдаленныеЗалоги();
	КонецЕсли;	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьИтоги()
	ИтогКоличество = ТаблицаТоваров.Итог("Количество");
	ИтогВес = ТаблицаТоваров.Итог("ВесИзделия"); 
	ИтогВесМеталла = ТаблицаТоваров.Итог("ВесМеталла");
    ИтогСуммаОценки = ТаблицаТоваров.Итог("СуммаОценки");
	ИтогСуммаОценкиМакс = ТаблицаТоваров.Итог("СуммаОценкиМакс"); 
	ИтогСуммаОценкиМеталлы = ТаблицаТоваров.Итог("СуммаОценкиМеталлы");
	ИтогСуммаОценкиВставки = ТаблицаТоваров.Итог("СуммаОценкиВставки");
	ИтогСуммаСсуды = ТаблицаТоваров.Итог("СуммаСсуды"); 
	ИтогУчетнаяЦена = ТаблицаТоваров.Итог("УчетнаяЦена");
	ИтогФактическаяЦена = ТаблицаТоваров.Итог("ФактическаяЦена");
КонецПроцедуры	  

&НаСервере
Процедура ЗаполнитьТаблицуТоваров(Добавление = Ложь)  
	Запрос = Новый Запрос;  
	СписокОЗ = Новый СписокЗначений;
	СписокЗБ = Новый СписокЗначений;
	Для каждого Стр Из Объект.Товары Цикл 
		Если СписокЗБ.НайтиПоЗначению(Стр.ЗалоговыйБилет) = неопределено Тогда 
			СписокЗБ.Добавить(Стр.ЗалоговыйБилет);
		КонецЕсли;	
		Если СписокОЗ.НайтиПоЗначению(Стр.ОбъектЗалога) = неопределено Тогда 
			СписокОЗ.Добавить(Стр.ОбъектЗалога);
		КонецЕсли;	
	КонецЦикла;	       
    Если Объект.Проведен Тогда
	    Запрос.УстановитьПараметр("Дата", Новый Граница(Объект.Ссылка.МоментВремени(), ВидГраницы.Исключая));
	Иначе 
		Запрос.УстановитьПараметр("Дата", Объект.Дата);
	КонецЕсли;	 
	Запрос.УстановитьПараметр("ЗалоговыеБилеты", СписокЗБ); 
	Запрос.УстановитьПараметр("ОбъектыЗалога", СписокОЗ);  
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.ЗалоговыйБилет КАК ЗалоговыйБилет,
	               |	ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.ОбъектЗалога КАК ОбъектЗалога,
	               |	ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.Артикул КАК Артикул,
	               |	ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.ВидИзделия КАК ВидИзделия,
	               |	ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.Проба КАК Проба,
	               |	ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.Категория КАК Категория,
	               |	ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.Вес КАК ВесИзделия,
	               |	ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.ВесЧистый КАК ВесМеталла,
	               |	ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.СуммаОценки КАК СуммаОценки,
	               |	ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.СуммаОценкиМакс КАК СуммаОценкиМакс,
	               |	ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.СуммаОценкиМеталлы КАК СуммаОценкиМеталлы,
	               |	ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.СуммаОценкиКамни КАК СуммаОценкиВставки,
	               |	ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.СуммаСсуды КАК СуммаСсуды,
	               |	1 КАК Количество,
	               |	ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.Вставки КАК Вставки,
	               |	ЛБ_ГруппыОбъектовЗалогаСрезПоследних.Группа КАК Группа,
	               |	ЕСТЬNULL(ЛБ_ЦеныОбъектовЗалогаСрезПоследних.Цена, 0) КАК УчетнаяЦена,
	               |	ЕСТЬNULL(ЛБ_ЦеныОбъектовЗалогаСрезПоследних.Цена, 0) КАК ФактическаяЦена,
	               |	ЗНАЧЕНИЕ(Перечисление.ЛБ_ОтклонениеОтБазовойЦены.Относительное) КАК ОтклонениеСкидки
	               |ИЗ
	               |	РегистрСведений.ЛБ_РеквизитыОбъектаЗалога.СрезПоследних(
	               |			&Дата,
	               |			ОбъектЗалога В (&ОбъектыЗалога)
	               |				И ЗалоговыйБилет В (&ЗалоговыеБилеты)) КАК ЛБ_РеквизитыОбъектаЗалогаСрезПоследних
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЛБ_ГруппыОбъектовЗалога.СрезПоследних(&Дата, ) КАК ЛБ_ГруппыОбъектовЗалогаСрезПоследних
	               |		ПО ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.ЗалоговыйБилет = ЛБ_ГруппыОбъектовЗалогаСрезПоследних.ЗалоговыйБилет
	               |			И ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.ОбъектЗалога = ЛБ_ГруппыОбъектовЗалогаСрезПоследних.ОбъектЗалога
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЛБ_ЦеныОбъектовЗалога.СрезПоследних(&Дата, ) КАК ЛБ_ЦеныОбъектовЗалогаСрезПоследних
	               |		ПО ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.ЗалоговыйБилет = ЛБ_ЦеныОбъектовЗалогаСрезПоследних.ЗалоговыйБилет
	               |			И ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.ОбъектЗалога = ЛБ_ЦеныОбъектовЗалогаСрезПоследних.ОбъектЗалога";
	ТаблицаЗапроса = Запрос.Выполнить().Выгрузить();
	ТаблицаТоваров.Загрузить(ТаблицаЗапроса); 
	Если НЕ Добавление Тогда
		Для каждого Стр Из Объект.Товары Цикл
			Отбор = Новый структура;
			Отбор.Вставить("ЗалоговыйБилет", стр.ЗалоговыйБилет); 
			Отбор.Вставить("ОбъектЗалога", стр.ОбъектЗалога);   
			
			СтрокиТ = ТаблицаТоваров.НайтиСтроки(Отбор);
			Если НЕ СтрокиТ.Количество() = 0 Тогда 
				СтрТ = СтрокиТ.Получить(0); 
				СтрТ.ФактическаяЦена = Стр.ФактическаяЦена; 
				Если ЗначениеЗаполнено(Стр.ОтклонениеСкидки) Тогда 
				   СтрТ.ОтклонениеСкидки = Стр.ОтклонениеСкидки;
				КонецЕсли;   
				СтрТ.Скидка = Стр.Скидка;
			КонецЕсли;	
		Конеццикла;	  
	КонецЕсли;	
	ЗаполнитьИтоги();
КонецПроцедуры	

&НаСервере
Функция ПолучитьЗаемщика(ЗБ) 
	Возврат ЗБ.Залогодатель;
КонецФункции

&НаКлиенте
Процедура ИсторияЗБ(Команда)
	ТекСтрока = Элементы.ТаблицаТоваров.ТекущиеДанные;
	Если ТекСтрока = неопределено Тогда
		Возврат;
	КонецЕсли;	
	Если ЗначениеЗаполнено(ТекСтрока.ЗалоговыйБилет) Тогда 
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("Клиент", ПолучитьЗаемщика(ТекСтрока.ЗалоговыйБилет));
		ПараметрыФормы.Вставить("ЗалоговыйБилет", ТекСтрока.ЗалоговыйБилет);	 
								
		ОткрытьФорму("Отчет.ЛБ_ИсторияЗалоговогоБилета.ФормаОбъекта", ПараметрыФормы, ЭтаФорма,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);   
	КонецЕсли;	 
КонецПроцедуры


&НаКлиенте
Процедура Расчеты(Команда)
	ТекСтрока = Элементы.ТаблицаТоваров.ТекущиеДанные;
	Если ТекСтрока = неопределено Тогда
		Возврат;
	КонецЕсли;	
	Если ЗначениеЗаполнено(ТекСтрока.ЗалоговыйБилет) Тогда 
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("Клиент", ПолучитьЗаемщика(ТекСтрока.ЗалоговыйБилет));
		ПараметрыФормы.Вставить("ЗалоговыйБилет", ТекСтрока.ЗалоговыйБилет);		
		ПараметрыФормы.Вставить("Дата", Объект.Дата);	 
		ПараметрыФормы.Вставить("Детально", Истина);
					
        ОткрытьФорму("Отчет.ЛБ_НачисленныеПроцентыПоДоговоруЗайма.ФормаОбъекта", ПараметрыФормы, ЭтаФорма,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	КонецЕсли;	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьОбъектыЗалогаДобавленныеВРеализацию(ЗалоговыйБилет, ОбъектЗалога) 
	Запись = РегистрыСведений.ЛБ_ОбъектыЗалогаДобавленныеВРеализацию.СоздатьМенеджерЗаписи();
	Запись.ОбъектЗалога = ОбъектЗалога;
	Запись.ЗалоговыйБилет = ЗалоговыйБилет;
	Запись.Прочитать();
	Если Запись.Выбран() Тогда 
		Если НЕ ЗначениеЗаполнено(Запись.ДокументРеализации) Тогда
			Запись.ДокументРеализации = Объект.Ссылка;
			Запись.Записать(); 
		КонецЕсли;	
	Иначе	
		Запись.ЗалоговыйБилет = ЗалоговыйБилет;
		Запись.ОбъектЗалога = ОбъектЗалога;
		Запись.ДокументРеализации = Объект.Ссылка;
	    Запись.Ответственный = Объект.ОтветственныйСотрудник;
		Запись.Записать();   
	КонецЕсли;	
КонецПроцедуры  

&НаСервере
Процедура УдалитьОбъектыЗалогаДобавленныеВРеализацию(ЗалоговыйБилет, ОбъектЗалога)
	НаборЗаписей = РегистрыСведений.ЛБ_ОбъектыЗалогаДобавленныеВРеализацию.СоздатьНаборЗаписей();
    НаборЗаписей.Отбор.ЗалоговыйБилет.Установить(ЗалоговыйБилет); 
	НаборЗаписей.Отбор.ОбъектЗалога.Установить(ОбъектЗалога);
    НаборЗаписей.Записать(); 
КонецПроцедуры

&НаСервере
Процедура ПолучитьТоварыПоОстаткам()  
	ТаблицаЗапроса = ЛБ_УправлениеЛомбардом.ПолучитьТоварыНаСкладеЛомбарда(Объект.Дата, Объект.Организация, Объект.Ломбард, Объект.Склад);
	УдСтроки = Новый СписокЗначений;
	Для каждого СтрЗ Из ТаблицаЗапроса Цикл   
		 РезультатПроверки = ЛБ_УправлениеЛомбардом.ПроверитьОбъектЗалогаДобавленВРеализацию(СтрЗ.ЗалоговыйБилет, СтрЗ.ОбъектЗалога); 
		 Если НЕ РезультатПроверки = неопределено Тогда 
			 УдСтроки.Добавить(СтрЗ);    
			 Артикул = ЛБ_УправлениеЛомбардом.ПолучитьАртикулОЗ(Объект.Дата, СтрЗ.ЗалоговыйБилет, СтрЗ.ОбъектЗалога);
			 Если ЗначениеЗаполнено(РезультатПроверки.Регистратор) Тогда
			     ТекстСообщения = "Внимание! Невостребованный залог с артикулом " + СокрЛП(Артикул) + " уже добавлен в документ «Реализация НЗ» № " + СокрЛП(РезультатПроверки.Регистратор.ПредставлениеНомера) + " от " + Формат(РезультатПроверки.Регистратор.Дата, "ДЛФ=");
			 Иначе 
			     ТекстСообщения = "Внимание! Невостребованный залог с артикулом " + СокрЛП(Артикул) + " уже добавлен в документ «Реализация НЗ», ответственный " + СокрЛП(РезультатПроверки.Ответственный);
			 КонецЕсли;	 
			 ТекстСообщения = ТекстСообщения + ". Добавление в текущий документ невозможно.";
			 ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
		 КонецЕсли;	 
		 Если ЛБ_УправлениеЛомбардом.ПроверитьЗалоговыйБилетСогласованКОплате(Объект.Дата, СтрЗ.ЗалоговыйБилет) Тогда
		  	 УдСтроки.Добавить(СтрЗ); 
			 Артикул = ЛБ_УправлениеЛомбардом.ПолучитьАртикулОЗ(Объект.Дата, СтрЗ.ЗалоговыйБилет, СтрЗ.ОбъектЗалога);
			 ТекстСообщения = "Внимание! Залоговый билет № " + СокрЛП(СтрЗ.ЗалоговыйБилет.НомерЗалоговогоБилета) + " согласован к оплате, невостребованный залог с артикулом " + СокрЛП(Артикул) + " добавить в текущий документ невозможно.";
			 ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
		 КонецЕсли;	  
		 Если ЛБ_УправлениеЛомбардом.ПолучитьСтатусЗалоговогоБилета(Объект.Дата, СтрЗ.ЗалоговыйБилет) = Перечисления.ЛБ_СтатусыЗалоговыхБилетов.ГотовКОтправкеОХ Тогда  
			 УдСтроки.Добавить(СтрЗ);
			 Артикул = ЛБ_УправлениеЛомбардом.ПолучитьАртикулОЗ(Объект.Дата, СтрЗ.ЗалоговыйБилет, СтрЗ.ОбъектЗалога);
			 ТекстСообщения = "Внимание! Залоговый билет № " + СокрЛП(СтрЗ.ЗалоговыйБилет.НомерЗалоговогоБилета) + " выкуплен заемщиком, залог с артикулом " + СокрЛП(Артикул) + " добавить в текущий документ невозможно.";
			 ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);      
		 КонецЕсли;	
	КонецЦикла;	 
	Для каждого Эл из УдСтроки Цикл 
		ТаблицаЗапроса.Удалить(Эл.Значение);
	КонецЦикла;	
	Объект.Товары.Загрузить(ТаблицаЗапроса); 
	Объект.Товары.Сортировать("ЗалоговыйБилет");
КонецПроцедуры	
	 
&НаКлиенте
Процедура Заполнить(Команда) 
	Если НЕ ЗначениеЗаполнено(Объект.Ломбард) Тогда  
		Сообщить("Выберите подразделение.", СтатусСообщения.Внимание);
		Возврат; 
	ИначеЕсли НЕ ЗначениеЗаполнено(Объект.Склад) Тогда  
		Сообщить("Выберите склад.", СтатусСообщения.Внимание);
		Возврат;	
	КонецЕсли;
	СписокТоваровДобавленоВРеализацию.Очистить();
	ПолучитьТоварыПоОстаткам();
	Для каждого Стр Из Объект.Товары Цикл
		ЗаполнитьОбъектыЗалогаДобавленныеВРеализацию(Стр.ЗалоговыйБилет, Стр.ОбъектЗалога);
	Конеццикла;	   
	ЗаполнитьТаблицуТоваров(Истина); 
	УстановитьДоступностьКонтрагента();
КонецПроцедуры 

&НаСервере
Процедура ДобавитьВТаблицуТоваров(ТаблицаОЗ)     
	УдСтроки = Новый СписокЗначений;
	Для каждого СтрЗ Из ТаблицаОЗ Цикл   
		 РезультатПроверки = ЛБ_УправлениеЛомбардом.ПроверитьОбъектЗалогаДобавленВРеализацию(СтрЗ.ЗалоговыйБилет, СтрЗ.ОбъектЗалога); 
		 Если НЕ РезультатПроверки = неопределено Тогда 
			 УдСтроки.Добавить(СтрЗ);    
			 Артикул = ЛБ_УправлениеЛомбардом.ПолучитьАртикулОЗ(Объект.Дата, СтрЗ.ЗалоговыйБилет, СтрЗ.ОбъектЗалога);
			 Если ЗначениеЗаполнено(РезультатПроверки.Регистратор) Тогда
			     ТекстСообщения = "Внимание! Невостребованный залог с артикулом " + СокрЛП(Артикул) + " уже добавлен в документ «Реализация НЗ» № " + СокрЛП(РезультатПроверки.Регистратор.ПредставлениеНомера) + " от " + Формат(РезультатПроверки.Регистратор.Дата, "ДЛФ=");
			 Иначе 
				 ТекстСообщения = "Внимание! Невостребованный залог с артикулом " + СокрЛП(Артикул) + " уже добавлен в документ «Реализация НЗ», ответственный " + СокрЛП(РезультатПроверки.Ответственный);
			 КонецЕсли;	 
			 ТекстСообщения = ТекстСообщения + ". Добавление в текущий документ невозможно.";
			 ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
		 КонецЕсли;	   
		 Если ЛБ_УправлениеЛомбардом.ПроверитьЗалоговыйБилетСогласованКОплате(Объект.Дата, СтрЗ.ЗалоговыйБилет) Тогда   
		  	 УдСтроки.Добавить(СтрЗ);                                                                                   
			 Артикул = ЛБ_УправлениеЛомбардом.ПолучитьАртикулОЗ(Объект.Дата, СтрЗ.ЗалоговыйБилет, СтрЗ.ОбъектЗалога);
			 ТекстСообщения = "Внимание! Залоговый билет № " + СокрЛП(СтрЗ.ЗалоговыйБилет.НомерЗалоговогоБилета) + " согласован к оплате, невостребованный залог с артикулом " + СокрЛП(Артикул) + " добавить в текущий документ невозможно.";
			 ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
		 КонецЕсли;	
		 Если ЛБ_УправлениеЛомбардом.ПолучитьСтатусЗалоговогоБилета(Объект.Дата, СтрЗ.ЗалоговыйБилет) = Перечисления.ЛБ_СтатусыЗалоговыхБилетов.ГотовКОтправкеОХ Тогда  
			 УдСтроки.Добавить(СтрЗ);
			 Артикул = ЛБ_УправлениеЛомбардом.ПолучитьАртикулОЗ(Объект.Дата, СтрЗ.ЗалоговыйБилет, СтрЗ.ОбъектЗалога);
			 ТекстСообщения = "Внимание! Залоговый билет № " + СокрЛП(СтрЗ.ЗалоговыйБилет.НомерЗалоговогоБилета) + " выкуплен заемщиком, залог с артикулом " + СокрЛП(Артикул) + " добавить в текущий документ невозможно.";
			 ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);      
		 КонецЕсли;	
	КонецЦикла;	 
	Для каждого Эл из УдСтроки Цикл 
		ТаблицаОЗ.Удалить(Эл.Значение);
	КонецЦикла;
	
	Если ТаблицаОЗ.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;	
	
	Запрос = Новый Запрос;  
	СписокОЗ = Новый СписокЗначений;
	СписокЗБ = Новый СписокЗначений;
	Для каждого Стр Из ТаблицаОЗ Цикл 
		Если СписокЗБ.НайтиПоЗначению(Стр.ЗалоговыйБилет) = неопределено Тогда 
			СписокЗБ.Добавить(Стр.ЗалоговыйБилет);
		КонецЕсли;	
		Если СписокОЗ.НайтиПоЗначению(Стр.ОбъектЗалога) = неопределено Тогда 
			СписокОЗ.Добавить(Стр.ОбъектЗалога);
		КонецЕсли;	
	КонецЦикла;	
	Запрос.УстановитьПараметр("Дата", Объект.Дата);  
	Запрос.УстановитьПараметр("ЗалоговыеБилеты", СписокЗБ); 
	Запрос.УстановитьПараметр("ОбъектыЗалога", СписокОЗ);
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.ЗалоговыйБилет КАК ЗалоговыйБилет,
	               |	ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.ОбъектЗалога КАК ОбъектЗалога,
	               |	ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.Артикул КАК Артикул,
	               |	ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.ВидИзделия КАК ВидИзделия,
	               |	ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.Проба КАК Проба,
	               |	ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.Категория КАК Категория,
	               |	ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.Вес КАК ВесИзделия,
	               |	ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.ВесЧистый КАК ВесМеталла,
	               |	ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.СуммаОценки КАК СуммаОценки,
	               |	ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.СуммаОценкиМакс КАК СуммаОценкиМакс,
	               |	ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.СуммаОценкиМеталлы КАК СуммаОценкиМеталлы,
	               |	ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.СуммаОценкиКамни КАК СуммаОценкиВставки,
	               |	ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.СуммаСсуды КАК СуммаСсуды,
	               |	1 КАК Количество,
	               |	ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.Вставки КАК Вставки,
	               |	ЛБ_ГруппыОбъектовЗалогаСрезПоследних.Группа КАК Группа,
	               |	ЕСТЬNULL(ЛБ_ЦеныОбъектовЗалогаСрезПоследних.Цена, 0) КАК УчетнаяЦена
	               |ИЗ
	               |	РегистрСведений.ЛБ_РеквизитыОбъектаЗалога.СрезПоследних(
	               |			&Дата,
	               |			ОбъектЗалога В (&ОбъектыЗалога)
	               |				И ЗалоговыйБилет В (&ЗалоговыеБилеты)) КАК ЛБ_РеквизитыОбъектаЗалогаСрезПоследних
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЛБ_ГруппыОбъектовЗалога.СрезПоследних(&Дата, ) КАК ЛБ_ГруппыОбъектовЗалогаСрезПоследних
	               |		ПО ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.ЗалоговыйБилет = ЛБ_ГруппыОбъектовЗалогаСрезПоследних.ЗалоговыйБилет
	               |			И ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.ОбъектЗалога = ЛБ_ГруппыОбъектовЗалогаСрезПоследних.ОбъектЗалога
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЛБ_ЦеныОбъектовЗалога.СрезПоследних(&Дата, ) КАК ЛБ_ЦеныОбъектовЗалогаСрезПоследних
	               |		ПО ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.ЗалоговыйБилет = ЛБ_ЦеныОбъектовЗалогаСрезПоследних.ЗалоговыйБилет
	               |			И ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.ОбъектЗалога = ЛБ_ЦеныОбъектовЗалогаСрезПоследних.ОбъектЗалога";
	ТаблицаЗапроса = Запрос.Выполнить().Выгрузить();
	
	Для каждого Стр Из ТаблицаЗапроса Цикл 
		Отбор = Новый структура;
		Отбор.Вставить("ЗалоговыйБилет", стр.ЗалоговыйБилет);
		Отбор.Вставить("ОбъектЗалога", стр.ОбъектЗалога);
		СтрокиТ = ТаблицаТоваров.НайтиСтроки(Отбор);
		Если СтрокиТ.Количество() = 0 Тогда
		    НоваяСтр = ТаблицаТоваров.Добавить(); 
			НоваяСтр.ЗалоговыйБилет = Стр.ЗалоговыйБилет;
			НоваяСтр.ОбъектЗалога = Стр.ОбъектЗалога;
			НоваяСтр.Артикул = Стр.Артикул;
			НоваяСтр.ВидИзделия = Стр.ВидИзделия;
			НоваяСтр.Проба = Стр.Проба;
			НоваяСтр.Категория = Стр.Категория;
			НоваяСтр.ВесИзделия = Стр.ВесИзделия;
			НоваяСтр.ВесМеталла = Стр.ВесМеталла;
			НоваяСтр.СуммаОценки = Стр.СуммаОценки;
			НоваяСтр.СуммаОценкиМакс = Стр.СуммаОценкиМакс;
			НоваяСтр.СуммаОценкиМеталлы = Стр.СуммаОценкиМеталлы;
			НоваяСтр.СуммаОценкиВставки = Стр.СуммаОценкиВставки;
			НоваяСтр.СуммаСсуды = Стр.СуммаСсуды;
			НоваяСтр.Количество = Стр.Количество;
			НоваяСтр.Вставки = Стр.Вставки;  
			НоваяСтр.Группа = Стр.Группа; 
			НоваяСтр.УчетнаяЦена = Стр.УчетнаяЦена;
			НоваяСтр.ФактическаяЦена = Стр.УчетнаяЦена;
			НоваяСтр.ОтклонениеСкидки = Перечисления.ЛБ_ОтклонениеОтБазовойЦены.Относительное;
			ЗаполнитьОбъектыЗалогаДобавленныеВРеализацию(Стр.ЗалоговыйБилет, Стр.ОбъектЗалога);
		КонецЕсли;	
	Конеццикла;    
	ЗаполнитьИтоги();   
	УстановитьДоступностьКонтрагента();
КонецПроцедуры	

&НаСервере
Функция ПолучитьТоварыПоОстаткамАртикул(Артикул)  
	ТаблицаЗапроса = ЛБ_УправлениеЛомбардом.ПолучитьТоварыНаСкладеЛомбардаПоАртикулу(Объект.Дата, Объект.Организация, Объект.Ломбард, Объект.Склад, Артикул);
	Если НЕ ТаблицаЗапроса.Количество() = 0 Тогда
	    ДобавитьВТаблицуТоваров(ТаблицаЗапроса); 
		Возврат "";
	Иначе          
		Возврат "Изделие с артикулом " + сокрЛП(Артикул) + " на складе не найдено.";
	КонецЕсли;	
КонецФункции	

&НаКлиенте
Процедура ЗаполнитьПоАртикулу(Команда) 
	Если НЕ ЗначениеЗаполнено(Объект.Ломбард) Тогда  
		Сообщить("Выберите подразделение.", СтатусСообщения.Внимание);
		Возврат; 
	ИначеЕсли НЕ ЗначениеЗаполнено(Объект.Склад) Тогда  
		Сообщить("Выберите склад.", СтатусСообщения.Внимание);
		Возврат;	
	КонецЕсли;	

	Артикул = "";
	Если ВвестиЗначение(Артикул, "Введите артикул") Тогда
	    СтрокаСообщение = ПолучитьТоварыПоОстаткамАртикул(Артикул);
		Если НЕ ПустаяСтрока(СтрокаСообщение) Тогда
			Предупреждение(СтрокаСообщение, 60);
		КонецЕсли;	
	КонецЕсли;	
КонецПроцедуры

&НаСервере
Функция ПолучитьТоварыПоОстаткамНомерЗБ(НомерЗБ)  
	ТаблицаЗапроса = ЛБ_УправлениеЛомбардом.ПолучитьТоварыНаСкладеЛомбардаПоНомеруЗБ(Объект.Дата, Объект.Организация, Объект.Ломбард, Объект.Склад, НомерЗБ);
	Если НЕ ТаблицаЗапроса.Количество() = 0 Тогда
	    ДобавитьВТаблицуТоваров(ТаблицаЗапроса); 
		Возврат "";
	Иначе          
		Возврат "Изделия из залогогового билета № " + сокрЛП(НомерЗБ) + " на складе не найдены.";
	КонецЕсли;	
КонецФункции	

&НаКлиенте
Процедура ЗаполнитьПоНомеруЗБ(Команда) 
	Если НЕ ЗначениеЗаполнено(Объект.Ломбард) Тогда  
		Сообщить("Выберите подразделение.", СтатусСообщения.Внимание);
		Возврат; 
	ИначеЕсли НЕ ЗначениеЗаполнено(Объект.Склад) Тогда  
		Сообщить("Выберите склад.", СтатусСообщения.Внимание);
		Возврат;	
	КонецЕсли;	

	НомерЗБ = "";
	Если ВвестиЗначение(НомерЗБ, "Введите номер ЗБ") Тогда
	    СтрокаСообщение = ПолучитьТоварыПоОстаткамНомерЗБ(НомерЗБ);
		Если НЕ ПустаяСтрока(СтрокаСообщение) Тогда
			Предупреждение(СтрокаСообщение, 60);
		КонецЕсли;	
	КонецЕсли;	
КонецПроцедуры


&НаСервере
Функция ПолучитьТоварыПоОстаткамПроба(Проба)  
	ТаблицаЗапроса = ЛБ_УправлениеЛомбардом.ПолучитьТоварыНаСкладеЛомбардаПоПробе(Объект.Дата, Объект.Организация, Объект.Ломбард, Объект.Склад, Проба);
	Если НЕ ТаблицаЗапроса.Количество() = 0 Тогда
	    ДобавитьВТаблицуТоваров(ТаблицаЗапроса); 
		Возврат "";
	Иначе          
		Возврат "Изделия из металла " + сокрЛП(Проба) + " на складе не найдены.";
	КонецЕсли;	
КонецФункции	

&НаКлиенте
Процедура ЗаполнитьПоПробе(Команда)   
	Если НЕ ЗначениеЗаполнено(Объект.Ломбард) Тогда  
		Сообщить("Выберите подразделение.", СтатусСообщения.Внимание);
		Возврат; 
	ИначеЕсли НЕ ЗначениеЗаполнено(Объект.Склад) Тогда  
		Сообщить("Выберите склад.", СтатусСообщения.Внимание);
		Возврат;	
	КонецЕсли;	

	Проба = ПредопределенноеЗначение("Справочник.ЛБ_Пробы.ПустаяСсылка");
	Если ВвестиЗначение(Проба, "Выберите пробу", Тип("СправочникСсылка.ЛБ_Пробы")) Тогда
	    СтрокаСообщение = ПолучитьТоварыПоОстаткамПроба(Проба);
		Если НЕ ПустаяСтрока(СтрокаСообщение) Тогда
			Предупреждение(СтрокаСообщение, 60);
		КонецЕсли;	
	КонецЕсли;	
КонецПроцедуры

&НаСервере
Функция ПолучитьТоварыПоОстаткамКатегория(Категория)  
	ТаблицаЗапроса = ЛБ_УправлениеЛомбардом.ПолучитьТоварыНаСкладеЛомбардаПоКатегории(Объект.Дата, Объект.Организация, Объект.Ломбард, Объект.Склад, Категория);
	Если НЕ ТаблицаЗапроса.Количество() = 0 Тогда
	    ДобавитьВТаблицуТоваров(ТаблицаЗапроса); 
		Возврат "";
	Иначе          
		Возврат "Изделия категории " + сокрЛП(Категория) + " на складе не найдены.";
	КонецЕсли;	
КонецФункции	

&НаКлиенте
Процедура ЗаполнитьПоКатегории(Команда)   
	Если НЕ ЗначениеЗаполнено(Объект.Ломбард) Тогда  
		Сообщить("Выберите подразделение.", СтатусСообщения.Внимание);
		Возврат; 
	ИначеЕсли НЕ ЗначениеЗаполнено(Объект.Склад) Тогда  
		Сообщить("Выберите склад.", СтатусСообщения.Внимание);
		Возврат;	
	КонецЕсли;	

	Категория = ПредопределенноеЗначение("Справочник.ЛБ_КатегорииОбъектовЗалога.ПустаяСсылка");
	Если ВвестиЗначение(Категория, "Выберите категорию", Тип("СправочникСсылка.ЛБ_КатегорииОбъектовЗалога")) Тогда
	    СтрокаСообщение = ПолучитьТоварыПоОстаткамКатегория(Категория);
		Если НЕ ПустаяСтрока(СтрокаСообщение) Тогда
			Предупреждение(СтрокаСообщение, 60);
		КонецЕсли;	
	КонецЕсли;	
КонецПроцедуры

&НаСервере
Функция ПолучитьТоварыПоОстаткамБриллианты()  
	ТаблицаЗапроса = ЛБ_УправлениеЛомбардом.ПолучитьТоварыНаСкладеЛомбардаПоВставкамБриллианты(Объект.Дата, Объект.Организация, Объект.Ломбард, Объект.Склад);
	Если НЕ ТаблицаЗапроса.Количество() = 0 Тогда
	    ДобавитьВТаблицуТоваров(ТаблицаЗапроса); 
		Возврат "";
	Иначе          
		Возврат "Изделия с бриллиантами на складе не найдены.";
	КонецЕсли;	
КонецФункции	


&НаКлиенте
Процедура ЗаполнитьПоВставкамБриллианты(Команда)   
	Если НЕ ЗначениеЗаполнено(Объект.Ломбард) Тогда  
		Сообщить("Выберите подразделение.", СтатусСообщения.Внимание);
		Возврат; 
	ИначеЕсли НЕ ЗначениеЗаполнено(Объект.Склад) Тогда  
		Сообщить("Выберите склад.", СтатусСообщения.Внимание);
		Возврат;	
	КонецЕсли;	

	СтрокаСообщение = ПолучитьТоварыПоОстаткамБриллианты();
	Если НЕ ПустаяСтрока(СтрокаСообщение) Тогда
		Предупреждение(СтрокаСообщение, 60);
	КонецЕсли;	
КонецПроцедуры


&НаСервере
Функция ПолучитьТоварыПоОстаткамБезВставок()  
	ТаблицаЗапроса = ЛБ_УправлениеЛомбардом.ПолучитьТоварыНаСкладеЛомбардаБезВставок(Объект.Дата, Объект.Организация, Объект.Ломбард, Объект.Склад);
	Если НЕ ТаблицаЗапроса.Количество() = 0 Тогда
	    ДобавитьВТаблицуТоваров(ТаблицаЗапроса); 
		Возврат "";
	Иначе          
		Возврат "Изделия с без вставок на складе не найдены.";
	КонецЕсли;	
КонецФункции	

&НаКлиенте
Процедура ЗаполнитьБезВставок(Команда) 
	Если НЕ ЗначениеЗаполнено(Объект.Ломбард) Тогда  
		Сообщить("Выберите подразделение.", СтатусСообщения.Внимание);
		Возврат; 
	ИначеЕсли НЕ ЗначениеЗаполнено(Объект.Склад) Тогда  
		Сообщить("Выберите склад.", СтатусСообщения.Внимание);
		Возврат;	
	КонецЕсли;	

	СтрокаСообщение = ПолучитьТоварыПоОстаткамБезВставок();
	Если НЕ ПустаяСтрока(СтрокаСообщение) Тогда
		Предупреждение(СтрокаСообщение, 60);
	КонецЕсли;	
КонецПроцедуры

&НаСервере
Функция ПолучитьТоварыПоОстаткамДопМеталлы()  
	ТаблицаЗапроса = ЛБ_УправлениеЛомбардом.ПолучитьТоварыНаСкладеЛомбардаПоДопМеталлам(Объект.Дата, Объект.Организация, Объект.Ломбард, Объект.Склад);
	Если НЕ ТаблицаЗапроса.Количество() = 0 Тогда
	    ДобавитьВТаблицуТоваров(ТаблицаЗапроса); 
		Возврат "";
	Иначе          
		Возврат "Изделия с несколькими металлами на складе не найдены.";
	КонецЕсли;	
КонецФункции	


&НаКлиенте
Процедура ЗаполнитьПоДопМатериалам(Команда) 
	Если НЕ ЗначениеЗаполнено(Объект.Ломбард) Тогда  
		Сообщить("Выберите подразделение.", СтатусСообщения.Внимание);
		Возврат; 
	ИначеЕсли НЕ ЗначениеЗаполнено(Объект.Склад) Тогда  
		Сообщить("Выберите склад.", СтатусСообщения.Внимание);
		Возврат;	
	КонецЕсли;	

	СтрокаСообщение = ПолучитьТоварыПоОстаткамДопМеталлы();
	Если НЕ ПустаяСтрока(СтрокаСообщение) Тогда
		Предупреждение(СтрокаСообщение, 60);
	КонецЕсли;	
КонецПроцедуры

&НаСервере
Функция ПолучитьТоварыПоОстаткамГруппа(Группа)  
	ТаблицаЗапроса = ЛБ_УправлениеЛомбардом.ПолучитьТоварыНаСкладеЛомбардаПоГруппе(Объект.Дата, Объект.Организация, Объект.Ломбард, Объект.Склад, Группа);
	Если НЕ ТаблицаЗапроса.Количество() = 0 Тогда
	    ДобавитьВТаблицуТоваров(ТаблицаЗапроса); 
		Возврат "";
	Иначе          
		Возврат "Изделия с группой " + сокрЛП(Группа) + " на складе не найдены.";
	КонецЕсли;	
КонецФункции	

&НаКлиенте
Процедура ЗаполнитьПоГруппе(Команда)
	Если НЕ ЗначениеЗаполнено(Объект.Ломбард) Тогда  
		Сообщить("Выберите подразделение.", СтатусСообщения.Внимание);
		Возврат; 
	ИначеЕсли НЕ ЗначениеЗаполнено(Объект.Склад) Тогда  
		Сообщить("Выберите склад.", СтатусСообщения.Внимание);
		Возврат;	
	КонецЕсли;	

	Группа = ПредопределенноеЗначение("Справочник.ЛБ_ГруппыОбъектовЗалога.ПустаяСсылка");
	Если ВвестиЗначение(Группа, "Введите группу") Тогда
	    СтрокаСообщение = ПолучитьТоварыПоОстаткамГруппа(Группа);
		Если НЕ ПустаяСтрока(СтрокаСообщение) Тогда
			Предупреждение(СтрокаСообщение, 60);
		КонецЕсли;	
	КонецЕсли;	
КонецПроцедуры

&НаСервере
Функция ПолучитьСкидку()    
	Если Объект.ВидОперации = Перечисления.ЛБ_ВидыОперацийРеализация.РеализацияЛомбард Тогда 
	    Возврат ЛБ_УправлениеЛомбардом.ПолучитьСкидку(Объект.Дата, Перечисления.ЛБ_СкидкаВДокументах.РеализацияЛомбард, Объект.Ломбард);
	ИначеЕсли Объект.ВидОперации = Перечисления.ЛБ_ВидыОперацийРеализация.РеализацияЦОРозница Тогда 
	    Возврат ЛБ_УправлениеЛомбардом.ПолучитьСкидку(Объект.Дата, Перечисления.ЛБ_СкидкаВДокументах.РеализацияРозница, Объект.Ломбард);
	Иначе
		Возврат неопределено;
	КонецЕсли;	
КонецФункции	

&НаКлиенте
Процедура СкидкаУстановить(Команда)
	РезультатС = ПолучитьСкидку(); 
	Если РезультатС = неопределено Тогда  
		Предупреждение("Для выбранной операции скидка не установлена", 60);
	Иначе	 
		Для каждого Стр Из ТаблицаТоваров Цикл 
			Если Стр.УчетнаяЦена = 0 Тогда
				Продолжить;
			КонецЕсли;
			
			Стр.ОтклонениеСкидки = РезультатС.Отклонение; 
			Стр.Скидка = РезультатС.Скидка;
			Если Стр.ОтклонениеСкидки = ПредопределенноеЗначение("Перечисление.ЛБ_ОтклонениеОтБазовойЦены.Абсолютное") Тогда  
				 Стр.ФактическаяЦена = Стр.УчетнаяЦена + Стр.Скидка;        
			ИначеЕсли Стр.ОтклонениеСкидки = ПредопределенноеЗначение("Перечисление.ЛБ_ОтклонениеОтБазовойЦены.Относительное") Тогда
				 Стр.ФактическаяЦена = Стр.УчетнаяЦена + Стр.УчетнаяЦена*Стр.Скидка/100;
			КонецЕсли;	
		КонецЦикла;	 
		ЗаполнитьИтоги();
		УстановитьДоступностьКонтрагента();
	КонецЕсли;
КонецПроцедуры


&НаКлиенте
Процедура СкидкаОтменить(Команда)
	Для каждого Стр Из ТаблицаТоваров Цикл 		
		Стр.ОтклонениеСкидки = ПредопределенноеЗначение("Перечисление.ЛБ_ОтклонениеОтБазовойЦены.Относительное"); 
		Стр.Скидка = 0;  
		Стр.ФактическаяЦена = Стр.УчетнаяЦена;
	КонецЦикла;	 
	ЗаполнитьИтоги();
	УстановитьДоступностьКонтрагента();
КонецПроцедуры


&НаКлиенте
Процедура ПересчитатьФактическуюЦену()
	ТекСтрока = Элементы.ТаблицаТоваров.ТекущиеДанные;
	Если НЕ ТекСтрока = неопределено Тогда 
		Если ТекСтрока.ОтклонениеСкидки = ПредопределенноеЗначение("Перечисление.ЛБ_ОтклонениеОтБазовойЦены.Абсолютное") Тогда  
			 ТекСтрока.ФактическаяЦена = ТекСтрока.УчетнаяЦена + ТекСтрока.Скидка;        
		ИначеЕсли ТекСтрока.ОтклонениеСкидки = ПредопределенноеЗначение("Перечисление.ЛБ_ОтклонениеОтБазовойЦены.Относительное") Тогда
			 ТекСтрока.ФактическаяЦена = ТекСтрока.УчетнаяЦена + ТекСтрока.УчетнаяЦена*ТекСтрока.Скидка/100;
		КонецЕсли;	
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаТоваровОтклонениеСкидкиПриИзменении(Элемент)
	ПересчитатьФактическуюЦену();
КонецПроцедуры


&НаКлиенте
Процедура ТаблицаТоваровСкидкаПриИзменении(Элемент)
	ПересчитатьФактическуюЦену();
КонецПроцедуры


&НаКлиенте
Процедура ОчиститьТаблицу(Команда)
	Для каждого Стр Из ТаблицаТоваров Цикл
	    УдалитьОбъектыЗалогаДобавленныеВРеализацию(Стр.ЗалоговыйБилет, Стр.ОбъектЗалога); 
	КонецЦикла;	
	ТаблицаТоваров.Очистить();   
	ЗаполнитьИтоги();
	УстановитьДоступностьКонтрагента();
КонецПроцедуры  


&НаКлиенте
Процедура ТаблицаТоваровПослеУдаления(Элемент)
	ЗаполнитьТаблицуДокумента();
	ЗаполнитьИтоги(); 
	УстановитьДоступностьКонтрагента();
КонецПроцедуры


&НаКлиенте
Процедура ВидОперацииПриИзменении(Элемент)    
	Если Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ЛБ_ВидыОперацийРеализация.РеализацияЦООпт") Тогда   
		Объект.Склад = ПолучитьСклад(ПредопределенноеЗначение("Перечисление.ЛБ_ВидыСкладов.ОбщийСкладЦО")); 
	ИначеЕсли Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ЛБ_ВидыОперацийРеализация.РеализацияЦОРозница") Тогда 
		Объект.Склад = ПолучитьСклад(ПредопределенноеЗначение("Перечисление.ЛБ_ВидыСкладов.ВитринаЦО"));
	ИначеЕсли Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ЛБ_ВидыОперацийРеализация.РеализацияЛомбард") Тогда  
		Объект.Склад = ПолучитьСклад(ПредопределенноеЗначение("Перечисление.ЛБ_ВидыСкладов.Витрина"));
	КонецЕсли;	
	УстановитьВидимость(); 
	Для каждого Стр Из ТаблицаТоваров Цикл
	    УдалитьОбъектыЗалогаДобавленныеВРеализацию(Стр.ЗалоговыйБилет, Стр.ОбъектЗалога); 
	КонецЦикла;	
	ТаблицаТоваров.Очистить();   
	ЗаполнитьИтоги();
	УстановитьДоступностьКонтрагента(); 
	Если Элементы.Контрагент.ТолькоПросмотр И НЕ ЗначениеЗаполнено(Объект.Контрагент) Тогда 
		Если НЕ Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ЛБ_ВидыОперацийРеализация.РеализацияЦООпт") Тогда
		    Объект.Контрагент = ПредопределенноеЗначение("Справочник._ДемоКонтрагенты.РозничныйПокупатель"); 
		КонецЕсли;	
	КонецЕсли;	 
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);

КонецПроцедуры


&НаКлиенте
Процедура ВыборСпособаОплатыПриИзменении(Элемент)
	УстановитьДоступностьКонтрагента();	
КонецПроцедуры


&НаКлиенте
Процедура ТаблицаТоваровПриИзменении(Элемент)  
	ЗаполнитьИтоги();
	УстановитьДоступностьКонтрагента();
КонецПроцедуры


&НаКлиенте
Процедура ВыбратьДляРеализацииОпт(Команда)
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Документ", Объект);
	ОбработкаВыбора = Новый ОписаниеОповещения("ПослеВыбораОпт",ЭтаФорма);
	ОткрытьФорму("ОбщаяФорма.ЛБ_ФормаВыбораРеализацииОпт", ПараметрыФормы, ЭтотОбъект,,,, ОбработкаВыбора, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

 &НаСервере
Процедура ПослеВыбораОпт(Результат, ДопПараметры) Экспорт
    Если Результат = неопределено Тогда
        Возврат;
	КонецЕсли;    
	
	Для каждого стр Из Результат.Товары Цикл   
		Отбор = Новый Структура;
		Отбор.Вставить("ЗалоговыйБилет", Стр.ЗалоговыйБилет);
		Отбор.Вставить("ОбъектЗалога", Стр.ОбъектЗалога);  
		Строки = Объект.Товары.НайтиСтроки(Отбор);
		Если НЕ Строки.Количество() = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		РезультатПроверки = ЛБ_УправлениеЛомбардом.ПроверитьОбъектЗалогаДобавленВРеализацию(Стр.ЗалоговыйБилет, Стр.ОбъектЗалога); 
		Если НЕ РезультатПроверки = неопределено Тогда     
			 Артикул = ЛБ_УправлениеЛомбардом.ПолучитьАртикулОЗ(Объект.Дата, Стр.ЗалоговыйБилет, Стр.ОбъектЗалога);
			 Если ЗначениеЗаполнено(РезультатПроверки.Регистратор) Тогда
			     ТекстСообщения = "Внимание! Невостребованный залог с артикулом " + СокрЛП(Артикул) + " уже добавлен в документ «Реализация НЗ» № " + СокрЛП(РезультатПроверки.Регистратор.ПредставлениеНомера) + " от " + Формат(РезультатПроверки.Регистратор.Дата, "ДЛФ=");
			 Иначе 
				 ТекстСообщения = "Внимание! Невостребованный залог с артикулом " + СокрЛП(Артикул) + " уже добавлен в документ «Реализация НЗ», ответственный " + СокрЛП(РезультатПроверки.Ответственный);
			 КонецЕсли;	 
			 ТекстСообщения = ТекстСообщения + ". Добавление в текущий документ невозможно.";
			 ОбщегоНазначения.СообщитьПользователю(ТекстСообщения); 
			 Продолжить;
		КонецЕсли;	 
		
	    НоваяСтр = Объект.Товары.Добавить();
		НоваяСтр.ЗалоговыйБилет = Стр.ЗалоговыйБилет; 
		НоваяСтр.ОбъектЗалога = Стр.ОбъектЗалога;
		НоваяСтр.Количество = Стр.Количество;
		НоваяСтр.ФактическаяЦена = Стр.ФактическаяЦена;
		ЗаполнитьОбъектыЗалогаДобавленныеВРеализацию(Стр.ЗалоговыйБилет, Стр.ОбъектЗалога);
	КонецЦикла;	  
	ЗаполнитьТаблицуТоваров();
	УстановитьДоступностьКонтрагента();
КонецПроцедуры


&НаКлиенте
Процедура КонтрагентНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	Если Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ЛБ_ВидыОперацийРеализация.РеализацияЦООпт") Тогда
		ОбработкаВыбора = Новый ОписаниеОповещения("ПослеВыбораКонтрагента",ЭтаФорма);
		ОткрытьФорму("Справочник._ДемоКонтрагенты.ФормаВыбора", , ЭтотОбъект,,,, ОбработкаВыбора, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	Иначе   
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("БезДокументов", истина);
		ОбработкаВыбора = Новый ОписаниеОповещения("ПослеВыбораЗалогодателя",ЭтаФорма);
		ОткрытьФорму("ОбщаяФорма.ЛБ_ПоискЗалогодателя", ПараметрыФормы, ЭтотОбъект,,,, ОбработкаВыбора, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	КонецЕсли;	
КонецПроцедуры

&НаСервере
Процедура ПослеВыбораЗалогодателя(Результат, ДопПараметры) Экспорт
    Если Результат = Неопределено Тогда
        Возврат;
	КонецЕсли;    
	
	Объект.Контрагент = Результат.Залогодатель;
КонецПроцедуры

&НаСервере
Процедура ПослеВыбораКонтрагента(Результат, ДопПараметры) Экспорт
    Если Результат = Неопределено Тогда
        Возврат;
	КонецЕсли;    
	
	Объект.Контрагент = Результат;
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаТоваровПередУдалением(Элемент, Отказ)  
	МассивИдентификаторов = Элементы.ТаблицаТоваров.ВыделенныеСтроки;

	Для Каждого Идентификатор Из МассивИдентификаторов Цикл
	    ТекСтрока = ТаблицаТоваров.НайтиПоИдентификатору(Идентификатор);
	    УдалитьОбъектыЗалогаДобавленныеВРеализацию(ТекСтрока.ЗалоговыйБилет, ТекСтрока.ОбъектЗалога);
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	ЭтаФорма.Заголовок = "Реализация невостребованных залогов № " + СокрЛП(Объект.ПредставлениеНомера) + " от " + Формат(Объект.Дата, "ДЛФ=DT");
КонецПроцедуры

&НаСервере
Процедура ВыборСкладаНаСервере() 
	Если Объект.ВидОперации = Перечисления.ЛБ_ВидыОперацийРеализация.РеализацияЛомбард Тогда
	     Объект.Склад = ЛБ_ОбщийМодуль.ПолучитьСклад(Объект.Ломбард, Перечисления.ЛБ_ВидыСкладов.Витрина);  
	ИначеЕсли Объект.ВидОперации = Перечисления.ЛБ_ВидыОперацийРеализация.РеализацияЦОРозница Тогда
	     Объект.Склад = ЛБ_ОбщийМодуль.ПолучитьСклад(Объект.Ломбард, Перечисления.ЛБ_ВидыСкладов.ВитринаЦО);  
	ИначеЕсли Объект.ВидОперации = Перечисления.ЛБ_ВидыОперацийРеализация.РеализацияЦООпт Тогда
	     Объект.Склад = ЛБ_ОбщийМодуль.ПолучитьСклад(Объект.Ломбард, Перечисления.ЛБ_ВидыСкладов.ОбщийСкладЦО); 
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ЛомбардПриИзменении(Элемент) 
	ВыборСкладаНаСервере();   
	Для каждого Стр Из ТаблицаТоваров Цикл
	    УдалитьОбъектыЗалогаДобавленныеВРеализацию(Стр.ЗалоговыйБилет, Стр.ОбъектЗалога); 
	КонецЦикла;	
	ТаблицаТоваров.Очистить();   
	ЗаполнитьИтоги();
	УстановитьДоступностьКонтрагента();
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьПоАртикулу(Команда)
	Если НЕ ЗначениеЗаполнено(Объект.Ломбард) Тогда  
		Сообщить("Выберите подразделение.", СтатусСообщения.Внимание);
		Возврат; 
	ИначеЕсли НЕ ЗначениеЗаполнено(Объект.Склад) Тогда  
		Сообщить("Выберите склад.", СтатусСообщения.Внимание);
		Возврат;	
	КонецЕсли;	

	Артикул = "";
	Если ВвестиЗначение(Артикул, "Введите артикул") Тогда
	    СтрокаСообщение = ПолучитьТоварыПоОстаткамАртикул(Артикул);
		Если НЕ ПустаяСтрока(СтрокаСообщение) Тогда
			Предупреждение(СтрокаСообщение, 60);
		КонецЕсли;	
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьПоНомеруЗБ(Команда)
	Если НЕ ЗначениеЗаполнено(Объект.Ломбард) Тогда  
		Сообщить("Выберите подразделение.", СтатусСообщения.Внимание);
		Возврат; 
	ИначеЕсли НЕ ЗначениеЗаполнено(Объект.Склад) Тогда  
		Сообщить("Выберите склад.", СтатусСообщения.Внимание);
		Возврат;	
	КонецЕсли;	

	НомерЗБ = "";
	Если ВвестиЗначение(НомерЗБ, "Введите номер ЗБ") Тогда
	    СтрокаСообщение = ПолучитьТоварыПоОстаткамНомерЗБ(НомерЗБ);
		Если НЕ ПустаяСтрока(СтрокаСообщение) Тогда
			Предупреждение(СтрокаСообщение, 60);
		КонецЕсли;	
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

КонецПроцедуры
